STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Pressbutton/STM32_WPAN/App/app_lld_ble.c
uint8_t* pressrxBuffer =  pressrxBufferTab;

/* data buffer ACK Tab to receive RX ACK after TX */
uint8_t pressAckrxBufferTab[258]={0x33,0x0C, 
0x3E,0xE3,0x28,0x82,0x64,0x46,0xC1,0x1C,0x78,0x87,0xDC,0xCD,
};
/* pointer of data buffer ACK Tab to receive RX ACK after TX */
uint8_t* pressAckrxBuffer= pressAckrxBufferTab;

/* Routines */
/* dataRoutine enum for LL and HAL dataRoutine() */
dataCase_t dataRoutineDone_hal_BLE = dataCase_Custom0;
dataCase_t dataRoutineTx_hal_BLE   = dataCase_Custom1;
dataCase_t dataRoutineRx_hal_BLE   = dataCase_Custom2;
dataCase_t dataRoutineStop_hal_BLE = dataCase_Custom3;

/* dataRoutine enum for LL dataRoutine() */
dataCase_t dataRoutine_LL_TxAck = dataCase_Custom4;
dataCase_t dataRoutine_LL_RxAck = dataCase_Custom5;
dataCase_t dataRoutine_Action   = dataCase_Custom6;

/* dataRoutine enum for HAL dataRoutine() */
dataCase_t dataRoutine_HAL_Tx    = dataCase_Custom4;
dataCase_t dataRoutine_HAL_TxAck = dataCase_Custom5;
dataCase_t dataRoutine_HAL_Rx    = dataCase_Custom6;
dataCase_t dataRoutine_HAL_RxAck = dataCase_Custom7;

/* Routines options */
uint32_t pressPacketNumber = 500; // NB of Successif PACKET using LL Send or Receive
uint32_t pressPacketNumberTx = 500; // NB of Successif PACKET using HAL Send 
uint32_t pressPacketNumberRx = 400; // NB of Successif PACKET using HAL Receive
uint8_t  pressPacketStopRx = 0; // Stop after RX

ActionPacket pressPacket[8];
Led_TypeDef LED_TXRX=LED_BLUE;

/* Hot config */
uint32_t LLD_BLE_hot_ana_config_table[BLE_HOT_ANA_CONFIG_TABLE_LENGTH/4];

/* Variable used with m0RadioProcess/m0CmdProcess */
static uint8_t   Toggle_in_progress=0;
static uint8_t   radioPacketNb=0;
static uint32_t  number_of_TXRX=0;
static uint32_t  number_of_RXACK=0;
/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/
void APP_LLD_BLE_Init( void )
{
  uint32_t devId = HAL_GetDEVID();
  uint32_t revId = HAL_GetREVID();
  uint8_t  param[8];
  char     traceBuff[50];
  
  SHCI_CmdStatus_t LldTestsInitStatus;
  
  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  CheckWirelessFirmwareInfo();
  
  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_LLD_BLE, UTIL_LPM_DISABLE);
  
  /* No need to activate the System low power mode as it is managed by the low-power test itself */
  UTIL_LPM_SetStopMode(1 << CFG_LPM_APP_LLD_BLE, UTIL_LPM_DISABLE );
  
  /* Init config buffer and call TL_LLD_BLE_Init */
  APP_LLD_BLE_Init_TL(); 

  /* Create a task to send CLI commands to M0 via IPCC */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_SEND_TO_M0, UTIL_SEQ_RFU, SendCmdToM0);

  /* Create a task to process data received from UART and create CLI commands */
  Appli_ProcessMode();
  UTIL_SEQ_RegTask( 1<<CFG_TASK_PROCESS_UART_RX_BUFFER, UTIL_SEQ_RFU, uartRxBufferProcess);
  
  /* Create tasks to process interrupt from/to UART to avoid locking UART during IT processing */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_PROCESS_UART_RX_IT, UTIL_SEQ_RFU, uartRxItProcess);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_PROCESS_UART_TX_IT, UTIL_SEQ_RFU, uartTxItProcess);
  
  /* Create a task to manage commands from M0 */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_CMD_FROM_M0_TO_M4, UTIL_SEQ_RFU, m0CmdProcess);

  /* Create Task for Appli */
  Appli_RegTask();

  /* Configure UART for receiving CLI command from PC and sending CLI response or notifications to PC */
  txBusy = 0;
  rxCmdAllowed = 0;
  txBuffer_Tab[TX_BUFFER_SIZE-1] = 0;
  txBuffer_wrPtr = 0;
  txBuffer_rdPtr = 0;
  rxBuffer_wrPtr = 0;
  rxBuffer_rdPtr = 0;
  currentCommandPos = 0;
  commandHistoryIdx = 0;
  commandHistoryIdxSav = 0;
  APP_LLD_BLE_Init_UART_CLI();
  
  /* Send LLD tests CLI start information to CLI UART */
  uartTxBufferAdd("\r\n\n================================\r\n");
#ifdef STM32WB35xx
  sprintf(traceBuff, "= Little DORY");
#else
  sprintf(traceBuff, "= DORY");
#endif
  sprintf(traceBuff, "%s RF LLD BLE \r\n", traceBuff );
  uartTxBufferAdd(traceBuff);
  uartTxBufferAdd("================================\r\n");
#if (CFG_FULL_LOW_POWER == 1U)
  uartTxBufferAdd("Low-power mode is activated\r\n");
#endif
#if (CFG_DEBUGGER_SUPPORTED == 0U)
  uartTxBufferAdd("Debugger de-activated\r\n");
#endif
#if (( CFG_DEBUG_TRACE_FULL == 0 ) && ( CFG_DEBUG_TRACE_LIGHT == 0 ))
  uartTxBufferAdd("Trace is de-activated\r\n");
#endif

#if 0
  APP_DBG("EXTI status");
  sprintf(traceBuff, "  IMR1 0x%08X   IMR2 0x%08X", EXTI->IMR1, EXTI->IMR2);
  APP_DBG(traceBuff);
  sprintf(traceBuff, "  EMR1 0x%08X   EMR2 0x%08X", EXTI->EMR1, EXTI->EMR2);
  APP_DBG(traceBuff);
  sprintf(traceBuff, "C2IMR1 0x%08X C2IMR2 0x%08X", EXTI->C2IMR1, EXTI->C2IMR2);
  APP_DBG(traceBuff);
  sprintf(traceBuff, "C2EMR1 0x%08X C2EMR2 0x%08X", EXTI->C2EMR1, EXTI->C2EMR2);
  APP_DBG(traceBuff);
#endif
  
#if 0
  // Read the RCC_CR register
  APP_DBG( "RCC_CR (0x%08X) = 0x%08X", (uint32_t)&(RCC->CR), RCC->CR);
  // RCC CFGR register
  APP_DBG( "RCC_CFGR (0x%08X) = 0x%08X", (uint32_t)&(RCC->CFGR), RCC->CFGR);
  // PLL_CFG register
  APP_DBG( "RCC_PLLCFGR (0x%08X) = 0x%08X", (uint32_t)&(RCC->PLLCFGR), RCC->PLLCFGR);
#endif
  
  /* Indicate end of M4 initialization */
  APP_DBG("Test appli initialized on M4, wait for M0 initialization");

  /* Send CLI start cmd to M0 (with device and revision ID as parameters */
  memcpy(&param[0], &devId, 4 );
  memcpy(&param[4], &revId, 4 );
  LldTestsInitStatus = SHCI_C2_LLD_BLE_Init(8, param);
  if(LldTestsInitStatus != SHCI_Success)
    APP_DBG((char *)"!! ERROR during M0 init !!");
  
  /* M0 init done, send first command to have M0 code info and thus, a first prompt will be printed automatically */
  /* Do not accept new command from UART until this one is managed */
  rxCmdAllowed = 0;
  currentCommandPos = 5;
  currentCommand[0] = HAL_BLE_UNUSED_CMDCODE ;/* HAL_BLE_INIT_CMDCODE cmdcode */
  currentCommand[1] = 'i';
  currentCommand[2] = 'n';
  currentCommand[3] = 'f';
  currentCommand[4] = 'o';
  currentCommand[5] = 0;
  /* Set corresponding task to send this command to M0 */
  UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_TO_M0, CFG_SCH_PRIO_0);
  
  /* Activate UART RX buffer processing task to allow USER command comming from UART */
  UTIL_SEQ_SetTask(1U << CFG_TASK_PROCESS_UART_RX_BUFFER, CFG_SCH_PRIO_0);

