STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Pressbutton/STM32_WPAN/App/app_lld_ble.c
    }
    else if (strncmp(bufferAddr, "Radio_End", 9) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_END;

      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
      
    } 
    else if (strncmp(bufferAddr, "Radio_RxAckEnd", 14) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_RXACKEND;

      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
      
    }    
    else if (strncmp(bufferAddr, "Radio_RxOkEnd", 13) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_RXOKEND;

      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);

    }
    else if (strncmp(bufferAddr, "Radio_RxAck", 11) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_RXACK;

      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
      
    }    
    else if (strncmp(bufferAddr, "Radio_RxOk", 10) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_RXOK;

      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);

    }
    else if (strncmp(bufferAddr, "stop0_on", 8) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_STOP0_ON;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "stop1_on", 8) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_STOP1_ON;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "stop2_on", 8) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_STOP2_ON;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "stop_off", 8) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_STOP_OFF;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "go_in_wfi", 9) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_GO_IN_WFI;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "go_directly_in_wfi", 18) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_GO_DIRECTLY_IN_WFI;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "use_msi_no_pll", 14) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_USE_MSI;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "use_msi_pll", 11) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_USE_MSI_PLL;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "use_hse_no_pll", 14) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_USE_HSE;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "use_hse_pll", 11) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_USE_HSE_PLL;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "ext_pa_enable", 13) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_EXT_PA_EN;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else if (strncmp(bufferAddr, "ext_pa_disable", 14) == 0)
    {
      // Save the command
      m0Cmd = CMD_FROM_M0_EXT_PA_DIS;
      // Set the task to process the command
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
    }
    else
    {
      APP_DBG((char *)"!! Unknown M0 command received by M4 !!");
    }
  }
  else
  {
    APP_DBG((char *)"!! Empty M0 command received by M4 !!");
  }
  SendM0CmdAckToM0();
}

/**
 * @brief  This function is called to Send Command to M0, Every lld_ble API call this function
 *
 * @param   currentCmd : a value of the lld_ble API
 * @param   currentPt : a pointer to param_hal_BLE_t
 * @return  M0 return value
 */
uint8_t APP_LLD_BLE_SendCmdM0(uint8_t currentCmd , uint32_t* currentPt)
{
  /* M0 init done, send first command to have M0 code info and thus, a first prompt will be printed automatically */
  /* Do not accept new command from UART until this one is managed */
  rxCmdAllowed = 0;
  currentCommandPos = 5;
  currentCommand[0] = currentCmd ;
  currentCommand[1] = (uint8_t)((((uint32_t)(currentPt)) >> 0) & 0xFF);
  currentCommand[2] = (uint8_t)((((uint32_t)(currentPt)) >> 8) & 0xFF);
  currentCommand[3] = (uint8_t)((((uint32_t)(currentPt)) >> 16) & 0xFF);
  currentCommand[4] = (uint8_t)((((uint32_t)(currentPt)) >> 24) & 0xFF);
  
  currentCommand[5] = 0;

  /* Set corresponding task to send this command to M0 */
  //UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_TO_M0, CFG_SCH_PRIO_0);
  UTIL_SEQ_ClrEvt(1U << CFG_EVT_RECEIVE_RSPACKEVT);
  SendCmdToM0();
  
  UTIL_SEQ_WaitEvt(1U << CFG_EVT_RECEIVE_RSPACKEVT);

  /* Activate UART RX buffer processing task to allow USER command comming from UART */
  //UTIL_SEQ_SetTask(1U << CFG_TASK_PROCESS_UART_RX_BUFFER, CFG_SCH_PRIO_0);
  return(((param_hal_BLE_t*)(currentPt))->return_value);

}

/**
 * @brief As the default systick is not used, declare here, at least, an empty function to 
 * over-write the default one as it declared as WEAK in HAL.
 */
void HAL_Delay(__IO uint32_t Delay)
{
  us_delay(Delay*1000);
  return;
}

/* USER CODE BEGIN FD */
/* Appli common functions */
void Appli_ProcessMode(void)
{
  uartRxBufferProcessMode(1); /* cmd mode */
}

void Appli_RegTask(void)
{
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HAL_BLE_INIT , UTIL_SEQ_RFU, BUTTON_SW1_BLE_Init);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HAL_BLE_SENDPACKET , UTIL_SEQ_RFU, BUTTON_SW2_SendPacket);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HAL_BLE_RECEIVEPACKET , UTIL_SEQ_RFU, BUTTON_SW3_ReceivePacket);
}

