STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Pressbutton/STM32_WPAN/App/app_lld_ble.c
void Appli_Init(void)
{
  HAL_TIM_Base_Start_IT(&htim2);
  HAL_TIM_Base_Stop_IT(&htim2);
}

void Appli_uartRxBufferPrint(void)
{
  //No Appli Print
}

/* Appli radio functions */
void Appli_m0RadioProcess_RadioStop(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}

void Appli_m0RadioProcess_RadioEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}

void Appli_m0RadioProcess_RxAck(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      /* copy payload from M0 BLE Radio */
      memcpy(rxBuffer_Ptr[radioPacketNb],(bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer),258); 
      number_of_RXACK++;
}

void Appli_m0RadioProcess_RxOk(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      *rxTimeStamp_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.timestamp_receive; // timestamp_receive
      *rxRSSI_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.rssi; // rssi
      /* copy payload from M0 BLE Radio */
      memcpy(rxBuffer_Ptr[radioPacketNb],(bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer),258); 
      number_of_TXRX++;
}

void Appli_m0RadioProcess_RxAckEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      /* copy payload from M0 BLE Radio */
      memcpy(rxBuffer_Ptr[radioPacketNb],(bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer),258); 
      number_of_RXACK++;
}

void Appli_m0RadioProcess_RxOkEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      *rxTimeStamp_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.timestamp_receive; // timestamp_receive
      *rxRSSI_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.rssi; // rssi
      /* copy payload from M0 BLE Radio */
      memcpy(rxBuffer_Ptr[radioPacketNb],(bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer),258); 
      number_of_TXRX++;
}

void Appli_m0CmdProcess_RadioStop(void)
{
      sprintf(cliPrompt, "> Radio STOP : RXACK:%d RX:%d",number_of_RXACK ,number_of_TXRX);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
      number_of_RXACK=0;
      number_of_TXRX=0;
}

void Appli_m0CmdProcess_RadioEnd(void)
{
      HAL_TIM_Base_Stop_IT(&htim2);
      Toggle_in_progress=0;
      BSP_LED_On(LED_RED);
      BSP_LED_On(LED_GREEN);
      sprintf(cliPrompt, "> Radio END: RXACK:%d RX:%d",number_of_RXACK ,number_of_TXRX);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
      number_of_RXACK=0;
      number_of_TXRX=0;
      if(uartLastChar)  uartLastChar=0;
}

void Appli_m0CmdProcess_RxAck(void)
{
      if(Toggle_in_progress!=1){
        Toggle_in_progress=1;
        HAL_TIM_Base_Start_IT(&htim2);
      }
      sprintf(cliPrompt, "> Radio RXACK %d",number_of_RXACK);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
}

void Appli_m0CmdProcess_RxOk(void)
{
      if(Toggle_in_progress!=1){
        Toggle_in_progress=1;
        HAL_TIM_Base_Start_IT(&htim2);
      }
      sprintf(cliPrompt, "> Radio RX %d",number_of_TXRX);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
}

void Appli_m0CmdProcess_RxAckEnd(void)
{
      HAL_TIM_Base_Stop_IT(&htim2);
      Toggle_in_progress=0;
      BSP_LED_On(LED_RED);
      BSP_LED_On(LED_GREEN);
      sprintf(cliPrompt, "> Radio END: RXACK:%d",number_of_RXACK);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
      number_of_RXACK=0;
}

void Appli_m0CmdProcess_RxOkEnd(void)
{
      HAL_TIM_Base_Stop_IT(&htim2);
      Toggle_in_progress=0;
      BSP_LED_On(LED_RED);
      BSP_LED_On(LED_GREEN);
      sprintf(cliPrompt, "> Radio END: RX:%d",number_of_TXRX);
      uartTxBufferAdd("\r\n");
      uartTxBufferAdd(cliPrompt);
      number_of_TXRX=0;
}

/* Appli custom functions */
void BUTTON_SW1_BLE_Init(void)
{
      if (use_hal ==0) {
        use_hal = 1 ;
        init_done = 0 ;
        BSP_LED_On(LED_BLUE);
        BSP_LED_Off(LED_GREEN);
        BSP_LED_Off(LED_RED);
      } else {
        use_hal = 0 ;
        init_done = 0 ;
        BSP_LED_Off(LED_BLUE); // default use LL
        BSP_LED_Off(LED_GREEN);
        BSP_LED_Off(LED_RED);
      }
}

void BUTTON_SW2_SendPacket(void)
{
  LED_TXRX=LED_GREEN;

  if (init_done ==0) {
      init_done =1 ;
      if (use_hal ==0) {
           #ifdef LLD_BLE_DEBUG
           bleparam_hal_BLE_Packet.InfoTime=(uint32_t)debug_timer;
           #endif
        LLD_BLE_Init(HS_STARTUP_TIME, 1, LLD_BLE_hot_ana_config_table, DISABLE);
                
        LLD_BLE_GetStatus(&presstime);

        uint8_t map[5]= {0xFF,0xFF,0xFF,0xFF,0xFF};
        LLD_BLE_SetChannelMap(STATE_MACHINE_0, &map[0]);
        LLD_BLE_SetChannel(STATE_MACHINE_0,pressChannel2,0);
        LLD_BLE_SetTxAttributes(STATE_MACHINE_0, pressID, 0x555555,0);
        LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_0, TX_PHY_2MBPS, RX_PHY_2MBPS);
        LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
        
        LLD_BLE_GetStatus(&presstime);

        LLD_BLE_SetChannelMap(STATE_MACHINE_3, &map[0]);
        LLD_BLE_SetChannel(STATE_MACHINE_3, pressChannel2, 0);
        LLD_BLE_SetTxAttributes(STATE_MACHINE_3, ~pressID, 0x555555,0);   
        LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_3, TX_PHY_2MBPS, RX_PHY_2MBPS);
        LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
        
        presstxBufferTab[257]= 0xAA;
        presstxBufferTab[256]= 0xBB;
        presstxBufferTab[255]= 0xCC;

      } else {
           #ifdef LLD_BLE_DEBUG
           bleparam_hal_BLE_Packet.InfoTime=(uint32_t)debug_timer;
           #endif
        HAL_BLE_Init();
        HAL_BLE_SetNetworkID(pressID);
      }
      BSP_LED_On(LED_GREEN);
      BSP_LED_On(LED_RED);
  }  else if(!use_hal) {
      LLD_BLE_GetStatus(&presstime);

   
      pressPacket[APACKET_0].StateMachineNo = STATE_MACHINE_0;   
      pressPacket[APACKET_0].ActionTag =  TXRX | PLL_TRIG | TIMER_WAKEUP | RELATIVE ;  
      pressPacket[APACKET_0].WakeupTime = pressWakeup;
      pressPacket[APACKET_0].ReceiveWindowLength = 0; /* does not affect for Tx */
      pressPacket[APACKET_0].data = presstxBuffer;
      pressPacket[APACKET_0].next_true = APACKET_1;
      pressPacket[APACKET_0].next_false = APACKET_NULL;   
      pressPacket[APACKET_0].condRoutine = condCase_Done;
      pressPacket[APACKET_0].dataRoutine = dataRoutine_LL_TxAck;
      pressPacket[APACKET_0].actionPacketNb = APACKET_0; 
      LLD_BLE_SetReservedArea(&pressPacket[APACKET_0]);

      pressPacket[APACKET_1].StateMachineNo = STATE_MACHINE_3;   
      pressPacket[APACKET_1].ActionTag =  0;   
      pressPacket[APACKET_1].WakeupTime = pressWakeup;
      pressPacket[APACKET_1].ReceiveWindowLength = pressReceive; 
      pressPacket[APACKET_1].data = pressAckrxBuffer; 
      pressPacket[APACKET_1].next_true = APACKET_NULL;
      pressPacket[APACKET_1].next_false = APACKET_0;    
      pressPacket[APACKET_1].condRoutine = condCase_Done;
      pressPacket[APACKET_1].dataRoutine = dataRoutine_LL_TxAck;
      pressPacket[APACKET_1].actionPacketNb = APACKET_1; 
      LLD_BLE_SetReservedArea(&pressPacket[APACKET_1]);

