STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Pressbutton/STM32_WPAN/App/app_lld_ble.c
      APP_LLD_BLE_SetdataRoutineOption(pressPacketNumber,pressPacketStopRx);
        #ifdef LLD_BLE_DEBUG
        start_timer=Debug_Start_timer();
        #endif
      LLD_BLE_MakeActionPacketPending(&pressPacket[APACKET_0]);
        #ifdef LLD_BLE_DEBUG
        stop_timer=Debug_Stop_timer();
        #endif
      BSP_LED_Off(LED_TXRX);

  } else {
      APP_LLD_BLE_SetdataRoutineOption(pressPacketNumberTx,pressPacketStopRx);
        #ifdef LLD_BLE_DEBUG
        start_timer=Debug_Start_timer();
        #endif
      HAL_BLE_SendPacketWithAck(pressChannel1, pressWakeup, presstxBuffer, pressAckrxBuffer, pressReceiveAck, dataRoutine_HAL_TxAck );
        #ifdef LLD_BLE_DEBUG
        stop_timer=Debug_Stop_timer();
        #endif
      BSP_LED_Off(LED_TXRX);
  }
}

void BUTTON_SW3_ReceivePacket(void)
{
  LED_TXRX=LED_RED;

  if (init_done ==0) {
      init_done =1 ;
      if (use_hal ==0) {
           #ifdef LLD_BLE_DEBUG
           bleparam_hal_BLE_Packet.InfoTime=(uint32_t)debug_timer;
           #endif
        LLD_BLE_Init(HS_STARTUP_TIME, 1, LLD_BLE_hot_ana_config_table, DISABLE);
                
        LLD_BLE_GetStatus(&presstime);

        uint8_t map[5]= {0xFF,0xFF,0xFF,0xFF,0xFF};
        LLD_BLE_SetChannelMap(STATE_MACHINE_0, &map[0]);
        LLD_BLE_SetChannel(STATE_MACHINE_0,pressChannel2,0);
        LLD_BLE_SetTxAttributes(STATE_MACHINE_0, pressID, 0x555555,0);
        LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_0, TX_PHY_2MBPS, RX_PHY_2MBPS);
        LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
        
        LLD_BLE_GetStatus(&presstime);

        LLD_BLE_SetChannelMap(STATE_MACHINE_3, &map[0]);
        LLD_BLE_SetChannel(STATE_MACHINE_3, pressChannel2, 0);
        LLD_BLE_SetTxAttributes(STATE_MACHINE_3, ~pressID, 0x555555,0);   
        LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_3, TX_PHY_2MBPS, RX_PHY_2MBPS);
        LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
        
      } else {
           #ifdef LLD_BLE_DEBUG
           bleparam_hal_BLE_Packet.InfoTime=(uint32_t)debug_timer;
           #endif
        HAL_BLE_Init();
        HAL_BLE_SetNetworkID(pressID);
      }
      BSP_LED_On(LED_GREEN);
      BSP_LED_On(LED_RED);
  } else if(!use_hal) {
      LLD_BLE_GetStatus(&presstime);
          
      pressPacket[APACKET_5].StateMachineNo = STATE_MACHINE_0;   
      pressPacket[APACKET_5].ActionTag =   PLL_TRIG | TIMER_WAKEUP | RELATIVE;  
      pressPacket[APACKET_5].WakeupTime = pressWakeup;
      pressPacket[APACKET_5].ReceiveWindowLength = pressReceive; /* does not affect for Tx */
      pressPacket[APACKET_5].data = pressrxBuffer;
      pressPacket[APACKET_5].next_true = APACKET_1;  // replaced &pressPacket[1]
      pressPacket[APACKET_5].next_false = APACKET_NULL;  // replaced &pressPacket[1]
      pressPacket[APACKET_5].condRoutine = condCase_Rx; //condCaseRx_Done
      pressPacket[APACKET_5].dataRoutine = dataRoutine_LL_RxAck; //dataRoutineRx switch
      pressPacket[APACKET_5].actionPacketNb = APACKET_5; 
      LLD_BLE_SetReservedArea(&pressPacket[APACKET_5]);

      pressPacket[APACKET_1].StateMachineNo = STATE_MACHINE_3;   
      pressPacket[APACKET_1].ActionTag =  TXRX;   
      pressPacket[APACKET_1].WakeupTime = pressWakeup;
      pressPacket[APACKET_1].ReceiveWindowLength = 0; 
      pressPacket[APACKET_1].data = pressAcktxBuffer; 
      pressPacket[APACKET_1].next_true = APACKET_NULL;
      pressPacket[APACKET_1].next_false = APACKET_5;    
      pressPacket[APACKET_1].condRoutine = condCase_Done; //condCaseRx_Ack
      pressPacket[APACKET_1].dataRoutine = dataRoutine_LL_RxAck; //dataRoutineRx switch
      pressPacket[APACKET_1].actionPacketNb = APACKET_1; 
      LLD_BLE_SetReservedArea(&pressPacket[APACKET_1]);
            
      APP_LLD_BLE_SetdataRoutineOption(pressPacketNumber,pressPacketStopRx);
      LLD_BLE_MakeActionPacketPending(&pressPacket[APACKET_5]);
      BSP_LED_Off(LED_TXRX);

  } else {
      APP_LLD_BLE_SetdataRoutineOption(pressPacketNumberRx,pressPacketStopRx);
      HAL_BLE_ReceivePacketWithAck(pressChannel1, pressWakeup, pressrxBuffer, pressAcktxBuffer, pressReceive, dataRoutine_HAL_RxAck );
      BSP_LED_Off(LED_TXRX);
  }
}
/* USER CODE END FD */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void Appli_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case BUTTON_SW1_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_INIT, CFG_SCH_PRIO_0);
      break; 

    case BUTTON_SW2_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_SENDPACKET, CFG_SCH_PRIO_0);
      break; 

    case BUTTON_SW3_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_RECEIVEPACKET, CFG_SCH_PRIO_0);
      break;

    default:
      break;

  }
  return;
}
void Appli_TIM_IC_CaptureCallback(void)
{
}

void Appli_TIM_PeriodElapsedCallback(void)
{
    BSP_LED_Toggle(LED_TXRX);
}
/* USER CODE END FD_WRAP_FUNCTIONS */

/* debug */
uint32_t Debug_Start_timer(void)
{
  debug_timer[0]=__HAL_TIM_GET_COUNTER(&htim2);
  if(!debug_timer[2])
  {
  return 0;
  } else
  {
  return(debug_timer[0]-debug_timer[2]);
  }
}
uint32_t Debug_Stop_timer(void)
{
  debug_timer[1]=__HAL_TIM_GET_COUNTER(&htim2);
  return(debug_timer[1]-debug_timer[0]);
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/